'''Определить время, через которое встретятся два тела, равноускоренно
движущиеся навстречу друг другу, если известны их начальные скорости,
ускорения и начальное расстояние между ними.'''
import math
a = int(input('Введите сторону треугольника '))
s = (math.sqrt(3)/4)*(a**2)
print(s)
