'''Дана сторона равностороннего треугольника. Найти площадь этого
треугольника.'''
import math
a = int(input('Введите сторону треугольника '))
s = (math.sqrt(3)/4)*(a**2)
print(s)
